"""10. Дано ціле число в діапазоні 100-999. Вивести рядок-опис даного числа, наприклад: 256 - "двісті
п'ятдесят шість", 814 - "вісімсот чотирнадцять»."""


def hundreds_dict(num: int) -> str:
    """Функция расчета сотен трехзначного числа"""
    hundred = num // 100
    hundreds = {
        1: "Сто ",
        2: "Двесте ",
        3: "Триста ",
        4: "Четыреста ",
        5: "Пятьсот ",
        6: "Шестьсот ",
        7: "Семьсот ",
        8: "Восемьсот ",
        9: "Девятьсот "
    }
    h = hundreds.get(hundred, "Ошибка!")
    return h


def tens_dict(num: int) -> str:
    """Функция расчета десятков трехзначного числа"""
    if (num % 100) // 10 == 1:
        ten = num % 100
    else:
        ten = (num % 100) // 10
    tens = {
        10: "Десять ",
        11: "Одинадцать ",
        12: "Двенадцать ",
        13: "Тринадцать ",
        14: "Четырнадцать ",
        15: "Пятнадцать ",
        16: "Шестнадцать ",
        17: "Семьнадцать ",
        18: "Восемьнадцать ",
        19: "Девятнадцать ",
        0: "",
        2: "Двадцать ",
        3: "Тридцать ",
        4: "Сорок ",
        5: "Пятьдесят",
        6: "Шестьдесят",
        7: "Семьдесят ",
        8: "Восемьдесят ",
        9: "Девяносто ",

    }
    t = tens.get(ten, "Ошибка!")
    return t


def units_dict(num: int) -> str:
    """Функция расчета единиц трехщначного числа"""
    if (num % 100) // 10 != 1:
        unit = num % 10
    units = {
    1: "Один ",
    2: "Два ",
    3: "Три ",
    4: "Четыре ",
    5: "Пять ",
    6: "Шесть ",
    7: "Семь ",
    8: "Восемь ",
    9: "Девять "
    }
    u = units.get(unit, "Ошибка!")
    return u


def main(y: int):
    if y >= 100 and y < 1000:
        return f'{hundreds_dict(y) + tens_dict(y) + units_dict(y)}'
    else:
        return "Error"


if __name__ == '__main__':
    N = int(input("Введите трехзначное число: "))
    result = main(N)
    print(result)

